<a href="https://colab.research.google.com/github/Bayaniblues/Lambda-precourse/blob/master/Pandas_cleaning_data_LECTURE.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

---
# Lambda School Data Science - Intro to Pandas 
---
# Lecture 07 - Cleaning Data 
---

### Cleaning data is an *integral part of being a data scientist*  
In most contexts, the data you'll be using to generate insights will not be perfect. Far from it. There will be missing values. There will be incorrect values. There could be duplicate values. Columns could have data types that break your code. There could be outliers that mess things up. You may even need to merge data from different sources to do a thorough analysis. Fortunately, pandas has some really powerful methods for cleaning your data. Which is good news, because most data scientists tend to spend the bulk of their time cleaning data before they can analyze it.  

*In other words, you clean your data in order to prepare it for analysis and model-building.*

### Begin by importing your tools

In [0]:
# Let's begin by importing pandas
import pandas as pd

## Reading in your data

In [0]:
# We use the pandas method pandas.read_csv("filepath") to create a DataFrame 
# and assign it to a variable:

df = pd.read_csv("https://raw.githubusercontent.com/axrd/datasets/master/gdpmessy.csv")

## Quick inspection of the data

In [0]:
# We'll use the head() method, which by default prints out the first 5 rows. I 
# want to look at the first 10 rows:
df.head(10)

   Unnamed: 0               COUNRY     gdp CODE
0           0          Afghanistan   21.71   AFG
1           1              Albania   13.40   ALB
2           2              Algeria  227.80   NaN
3           3       American Samoa    0.75   ASM
4           4              Andorra     NaN   AND
5           5                  NaN  131.40   AGO
6           6             Anguilla    0.18   AIA
7           7  Antigua and Barbuda    1.24   ATG
8           8            Argentina  536.20   ARG
9           9              Armenia   10.88   ARM

In [0]:
# Then the tail method. Also for 10 values.
df.tail(10)

     Unnamed: 0          COUNRY      gdp CODE
212         212         Uruguay    55.60   URY
213         213      Uzbekistan    63.08   UZB
214         214         Vanuatu  8200.00   VUT
215         215       Venezuela   209.20   VEN
216         216         Vietnam   187.80   VNM
217         217  Virgin Islands     5.08   VGB
218         218       West Bank     6.64   WBG
219         219           Yemen    45.45   YEM
220         220          Zambia    25.61   ZMB
221         221        Zimbabwe    13.74   ZWE

In [0]:
# We're supposed to have 222 observations (rows) and 3 columns. Let's check:

df.shape

(222, 4)

In [0]:
# A great way to get an overview of our data:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 222 entries, 0 to 221
Data columns (total 4 columns):
Unnamed: 0    222 non-null int64
COUNRY        221 non-null object
gdp           219 non-null float64
CODE          220 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 7.0+ KB

**We've got some missing values! We'll address that in a minute. First, let's fix our duplicate index and rename our columns something useful and consistent.**

## Duplicate index
**Remember how we dealt with this a few assignments ago, as we were learning about loading data?**

In [0]:
df.columns

Index(['Unnamed: 0', 'COUNRY', 'gdp', 'CODE '], dtype='object')

In [0]:
# We need to drop the first column (axis = 1) and do it in place:
df.drop('Unnamed: 0', axis=1, inplace=True)

In [0]:
df.head()

           COUNRY     gdp CODE
0     Afghanistan   21.71   AFG
1         Albania   13.40   ALB
2         Algeria  227.80   NaN
3  American Samoa    0.75   ASM
4         Andorra     NaN   AND

## Column names

**We also covered how to rename columns. But we only showed you how to rename one at a time:**  

*   COUNRY should be spelled correctly
*   gdp is lowercase and should also communicate scale
*   CODE has an trailing space in it  


**Here's how we'd do it piecemeal:**

`df.rename(columns={'COUNRY':'COUNTRY'}, inplace=True)`  
`df.rename(columns={'gdp':'GDP (BILLIONS)'}, inplace=True)`  
`df.rename(columns={'CODE ':'CODE'}, inplace=True)`

**But that's not Pythonic. Let's try and change all of these column names at once.**

In [0]:
# Pandas has a way to select columns because it treats them as an index object:
df.columns

# Notice that "CODE " has an empty space after the last character. This happens!

Index(['COUNRY', 'gdp', 'CODE '], dtype='object')

In [0]:
df['CODE ']

0      AFG
1      ALB
2      NaN
3      ASM
4      AND
5      AGO
6      AIA
7      ATG
8      ARG
9      ARM
10     ABW
11     AUS
12     AUT
13     NaN
14     BHM
15     BHR
16     BGD
17     BRB
18     BLR
19     BEL
20     BLZ
21     BEN
22     BMU
23     BTN
24     BOL
25     BIH
26     BWA
27     BRA
28     VGB
29     BRN
      ...
192    SWE
193    CHE
194    SYR
195    TWN
196    TJK
197    TZA
198    THA
199    TLS
200    TGO
201    TON
202    TTO
203    TUN
204    TUR
205    TKM
206    TUV
207    UGA
208    UKR
209    ARE
210    GBR
211    USA
212    URY
213    UZB
214    VUT
215    VEN
216    VNM
217    VGB
218    WBG
219    YEM
220    ZMB
221    ZWE
Name: CODE , Length: 222, dtype: object

In [0]:
df.columns = ["COUNTRY", "GDP_BILLIONS", "CODE"]

In [0]:
df.columns

# Done.

Index(['COUNTRY', 'GDP_BILLIONS', 'CODE'], dtype='object')

In [0]:
list(df.columns)

['COUNTRY', 'GDP_BILLIONS', 'CODE']

In [0]:
df.head()

          COUNTRY  GDP_BILLIONS CODE
0     Afghanistan         21.71  AFG
1         Albania         13.40  ALB
2         Algeria        227.80  NaN
3  American Samoa          0.75  ASM
4         Andorra           NaN  AND

In [0]:
df['GDP_BILLIONS']

## Missing values?
We noticed immediately that we had some missing values to deal with. Every feature has at least one missing value (nulls).

In [0]:
# Pandas has a nifty tool to check for null values. For now, you can think of 
# nulls as missing values. 

df.isnull()

     COUNTRY  GDP_BILLIONS   CODE
0      False         False  False
1      False         False  False
2      False         False   True
3      False         False  False
4      False          True  False
5       True         False  False
6      False         False  False
7      False         False  False
8      False         False  False
9      False         False  False
10     False          True  False
11     False         False  False
12     False         False  False
13     False         False   True
14     False         False  False
15     False         False  False
16     False         False  False
17     False         False  False
18     False         False  False
19     False         False  False
20     False          True  False
21     False         False  False
22     False         False  False
23     False         False  False
24     False         False  False
25     False         False  False
26     False         False  False
27     False         False  False
28     False         False  False
29     False         False  False
..       ...           ...    ...
192    False         False  False
193    False         False  False
194    False         False  False
195    False         False  False
196    False         False  False
197    False         False  False
198    False         False  False
199    False         False  False
200    False         False  False
201    False         False  False
202    False         False  False
203    False         False  False
204    False         False  False
205    False         False  False
206    False         False  False
207    False         False  False
208    False         False  False
209    False         False  False
210    False         False  False
211    False         False  False
212    False         False  False
213    False         False  False
214    False         False  False
215    False         False  False
216    False         False  False
217    False         False  False
218    False         False  False
219    False         False  False
220    False         False  False
221    False         False  False

[222 rows x 3 columns]

In [0]:
# Ok, but scrolling throuh 222 rows looking for "True" sounds awful. There has 
# to be a better way, right? There is. Remember the sum function?

df.isnull().sum()

# Six targets. Let's take them one at a time. Starting with "Country".

COUNTRY         1
GDP_BILLIONS    3
CODE            2
dtype: int64

In [0]:
# We'll subset our data by choosing ALL the rows that have missing values.

df[df.isnull().any(axis=1)]

       COUNTRY  GDP_BILLIONS CODE
2      Algeria        227.80  NaN
4      Andorra           NaN  AND
5          NaN        131.40  AGO
10       Aruba           NaN  ABW
13  Azerbaijan         77.91  NaN
20      Belize           NaN  BLZ

**Let's say we were able to identify the actual values that belong in the DataFrame as follows:**



*   Algeria has an Alpha-3 code of DZA
*   Andorra has a GDP of 4.80 billion
*   Azerbaijan has an Alpha-3 code of AZE
*   Aruba has a GDP of 2.52 billion
*   Belize has a GDP of 1.67 billion
*   Angola is the missing 'COUNTRY' value  


We'll use the pandas [at() method to handle this.](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.at.html)

In [0]:
# We specify the row index, the column name, and the value we'd like to assign to it:
df.at[2, "CODE"] = "DZA"
df.at[4, "GDP_BILLIONS"] = 4.80
df.at[5, "COUNTRY"] = "Angola"
df.at[10, "GDP_BILLIONS"] = 2.52
df.at[13, "CODE"] = "AZE"
df.at[20, "GDP_BILLIONS"] = 1.67

In [0]:
df.isnull().sum()

COUNTRY         0
GDP_BILLIONS    0
CODE            0
dtype: int64

In [0]:
df.head(10)

               COUNTRY  GDP_BILLIONS CODE
0          Afghanistan         21.71  AFG
1              Albania         13.40  ALB
2              Algeria        227.80  DZA
3       American Samoa          0.75  ASM
4              Andorra          4.80  AND
5               Angola        131.40  AGO
6             Anguilla          0.18  AIA
7  Antigua and Barbuda          1.24  ATG
8            Argentina        536.20  ARG
9              Armenia         10.88  ARM

## Less obvious things:
We checked for missing values, but now we need to worry about duplicate or incorrect values. Let's look for duplicates.  

We'll use the value_counts() method, sorted to see where any values appear more than once. The head() at the end of the chain limits our output to five observations to keep things manageable. If any of them have multiple values beyond the first five observations, we'll expand the head until we account for all duplicates.

In [0]:
df["COUNTRY"].value_counts(sort=True).head()

Togo          1
Tanzania      1
Tonga         1
Macau         1
Tajikistan    1
Name: COUNTRY, dtype: int64

That one's good to go. No duplicates (we wouldn't expect any here).

In [0]:
df["GDP_BILLIONS"].value_counts(sort=True).head(5)

0.18     3
0.75     2
0.16     2
70.03    1
10.92    1
Name: GDP_BILLIONS, dtype: int64

Ok. Several duplicates. But we'd expect some in GDP since we're using billions and only two decimal places. In terms of preparing our data, next steps here would be to double-check those values with official records. Alternatively, we could add decimal places for greater precision.

In [0]:
df["CODE"].value_counts(sort=True).head()

VGB    2
HKG    2
FLK    1
ZWE    1
CHN    1
Name: CODE, dtype: int64

This one's dangerous. Like "COUNTRY" we wouldn't expect any duplicate values here, but we've got two. Let's see what's going on:

In [0]:
df[df['CODE'] == "VGB"]

                    COUNTRY  GDP_BILLIONS CODE
28   British Virgin Islands          1.10  VGB
217          Virgin Islands          5.08  VGB

So there's the British Virgin Islands and the American Virgin Islands. The latter has an A-3 code of VIR, not VGB. Let's fix it:

In [0]:
df.at[217, "CODE"] = "VIR"

In [0]:
df[df['CODE'] == "HKG"]

      COUNTRY  GDP_BILLIONS CODE
89  Hong Kong         292.7  HKG
90    Hungary         129.7  HKG

Hungary is supposed to be HUN. Let's change it:

In [0]:
df.at[90, "CODE"] = "HUN"

To be thorough, let's make sure our changes didn't create any new duplicates in the "CODE" column:

In [0]:
df["CODE"].value_counts(sort=True).head()

FLK    1
BGD    1
KEN    1
BLZ    1
CHN    1
Name: CODE, dtype: int64

## Even less obvious things

In [0]:
df.sort_values(by='GDP_BILLIONS', ascending=False).head(10)

            COUNTRY  GDP_BILLIONS CODE
211   United States       17420.0  USA
42            China       10360.0  CHN
214         Vanuatu        8200.0  VUT
101           Japan        4770.0  JPN
75          Germany        3820.0  DEU
70           France        2902.0  FRA
210  United Kingdom        2848.0  GBR
27           Brazil        2244.0  BRA
99            Italy        2129.0  ITA
164          Russia        2057.0  RUS

Clearly, Vanuatu isn't the 3rd largest economy in the world. Its GDP is actually supposed to be 0.82 billion.

In [0]:
df.at[214, "GDP (BILLIONS)"] = 0.82



---


## Assignment time!